Revit 2026 API

# LoadCaseCategory Enumeration

---

Specifies load case category.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadCaseCategory
```
```vb
Public Enumeration LoadCaseCategory
```
```cpp
public enum class LoadCaseCategory
```
```fsharp
type LoadCaseCategory
```

| Member name | Value | Description |
| --- | --- | --- |
| Accidental | 5 | Accidental |
| Dead | 0 | Dead |
| Live | 1 | Live |
| RoofLive | 4 | Roof Live |
| Seismic | 7 | Seismic |
| Snow | 3 | Snow |
| Temperature | 6 | Temperature |
| Wind | 2 | Wind |

#### Reference

Autodesk.Revit.DB.Structure Namespace